In [8]:
import pandas as pd
#movie_cols = ['movie_id', 'title']
movies = pd.read_table("/Users/riteshtripathi/Desktop/ml-100k/u.data")

In [9]:
movies

       196   242  3  881250949
0      186   302  3  891717742
1       22   377  1  878887116
2      244    51  2  880606923
3      166   346  1  886397596
4      298   474  4  884182806
...    ...   ... ..        ...
99994  880   476  3  880175444
99995  716   204  5  879795543
99996  276  1090  1  874795795
99997   13   225  2  882399156
99998   12   203  3  879959583

[99999 rows x 4 columns]

In [11]:
movies_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
#above col has different names that are not easily understood, lets give names to those colns
movies_cols

['user_id', 'movie_id', 'rating', 'timestamp']

In [18]:
rating_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table("/Users/riteshtripathi/Desktop/ml-100k/u.data", sep='\t', header=None, names=rating_cols)

In [19]:
ratings

       user_id  movie_id  rating  timestamp
0          196       242       3  881250949
1          186       302       3  891717742
2           22       377       1  878887116
3          244        51       2  880606923
4          166       346       1  886397596
...        ...       ...     ...        ...
99995      880       476       3  880175444
99996      716       204       5  879795543
99997      276      1090       1  874795795
99998       13       225       2  882399156
99999       12       203       3  879959583

[100000 rows x 4 columns]

In [20]:
ratings.shape

(100000, 4)

In [21]:
ratings.movie_id.nunique()#there are 1682 movie id's

1682

In [22]:
ratings.loc[ratings.movie_id == 1, :].head()
#i want rows where movie_id == 1 and i want all columns and head() is selecting few rows

      user_id  movie_id  rating  timestamp
24        308         1       4  887736532
454       287         1       5  875334088
957       148         1       4  877019411
971       280         1       4  891700426
1324       66         1       3  883601324

In [28]:
movie_cols = ['movie_id', 'title']
movies = pd.read_table("/Users/riteshtripathi/Desktop/ml-100k/u.item", encoding='ISO-8859-1', sep='|', header=None, names=movie_cols, usecols=[0, 1])
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [29]:
movies.shape

(1682, 2)

In [30]:
#now i want to merge movies and ratings with movie name to movie_id
#i want to know in ratings table, what is movie_id 242
#lets find out what and how many colns are in both tables
movies.columns

Index(['movie_id', 'title'], dtype='object')

In [31]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [33]:
#lets use pd.merge to merge both tables
movie_ratings = pd.merge(movies, ratings)#this will join all the columns having same names in both tables
movie_ratings.columns

Index(['movie_id', 'title', 'user_id', 'rating', 'timestamp'], dtype='object')

In [34]:
#lets see the result
movie_ratings.head()

   movie_id             title  user_id  rating  timestamp
0         1  Toy Story (1995)      308       4  887736532
1         1  Toy Story (1995)      287       5  875334088
2         1  Toy Story (1995)      148       4  877019411
3         1  Toy Story (1995)      280       4  891700426
4         1  Toy Story (1995)       66       3  883601324

In [35]:
#pandas is getting all movie id 1 matching with in table of ratings and displaying all results
movie_ratings.tail()

,movie_id,title,user_id,rating,timestamp
99995,1678,Mat' i syn (1997),863,1,889289570
99996,1679,B. Monkey (1998),863,3,889289491
99997,1680,Sliding Doors (1998),863,2,889289570
99998,1681,You So Crazy (1994),896,3,887160722
99999,1682,Scream of Stone (Schrei aus Stein) (1991),916,3,880845755

In [ ]:
#therefore: in movies table there were 1682 rows and 2 cols
#in ratings table, there were 100,000 rows and 4 cols
#after merging there were still 100,000 rows because they were the match from both tables with 5 colns

In [ ]:
#Scenario 2, 
#what if colns in both tables have no same names

In [36]:
movies.columns = ['m_id', 'title']#lets change the col names in movies table
movies.columns

Index(['m_id', 'title'], dtype='object')

In [37]:
#lets check ratings table colns
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [ ]:
#as we see we dont have any matching column names in both tables

In [38]:
pd.merge(movies, ratings, left_on='m_id', right_on='movie_id').head()
#here first table becomes left
#second table becomes right
#we merge m_id from left with movie_id from right coln

   m_id             title  user_id  movie_id  rating  timestamp
0     1  Toy Story (1995)      308         1       4  887736532
1     1  Toy Story (1995)      287         1       5  875334088
2     1  Toy Story (1995)      148         1       4  877019411
3     1  Toy Story (1995)      280         1       4  891700426
4     1  Toy Story (1995)       66         1       3  883601324

In [ ]:
#Scenario 3
#what if i want to join on Index
#so far we been joining on two indexes

In [39]:
movies = movies.set_index('m_id')
movies.head()

                  title
m_id
1      Toy Story (1995)
2      GoldenEye (1995)
3     Four Rooms (1995)
4     Get Shorty (1995)
5        Copycat (1995)

In [ ]:
#above has changed from 0,1,2...index to m_id as being the default index

In [40]:
#lets merge
pd.merge(movies, ratings, left_index=True, right_on='movie_id').head()

                 title  user_id  movie_id  rating  timestamp
24    Toy Story (1995)      308         1       4  887736532
454   Toy Story (1995)      287         1       5  875334088
957   Toy Story (1995)      148         1       4  877019411
971   Toy Story (1995)      280         1       4  891700426
1324  Toy Story (1995)       66         1       3  883601324

In [41]:
#Scenario 4
#What if i want to join on two indexes
ratings = ratings.set_index('movie_id')
ratings.head()

          user_id  rating  timestamp
movie_id
242           196       3  881250949
302           186       3  891717742
377            22       1  878887116
51            244       2  880606923
346           166       1  886397596

In [42]:
pd.merge(movies, ratings, left_index=True, right_index=True).head()

              title  user_id  rating  timestamp
1  Toy Story (1995)      308       4  887736532
1  Toy Story (1995)      287       5  875334088
1  Toy Story (1995)      148       4  877019411
1  Toy Story (1995)      280       4  891700426
1  Toy Story (1995)       66       3  883601324

In [ ]:
#So far we been using a concept called "Inner Join"
#There are Four types of JOINS: 
#Inner
#Outer
#Left
#Right
#Lets create two DataFrames A and B to understand each JOINS

In [43]:
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [44]:
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

In [45]:
#Inner Join
#Only include observations found in both A and B
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

In [46]:
#Outer Join
#Include observations found in either A or B:
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

In [47]:
#Left Join
#Include all observations found in A
pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

In [48]:
#Right Join
#Include all observations found in B
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L